БИТУправление_медицинским_центром_демо/src/Catalogs/СтепениРодства/СтепениРодства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтепениРодства</name>
  <attributes>
    <name>КодФСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКИН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодЕГИСЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/СвязиМеждуКлиентами/СвязиМеждуКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязиМеждуКлиентами</name>
  <resources>
    <name>ТипСвязи</name>
    <type>
      <types>CatalogRef.СтепениРодства</types>
    </type>
  </resources>
  <resources>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент2</name>
    <type>
      <types>CatalogRef.Клиенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/ПолФизическихЛиц/ПолФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПолФизическихЛиц</name>
  <comment>Пол физических лиц</comment>
  <enumValues>
    <name>НеУказан</name>
    <comment>Пол не указан</comment>
  </enumValues>
  <enumValues>
    <name>Мужской</name>
    <comment>Пол мужской</comment>
  </enumValues>
  <enumValues>
    <name>Женский</name>
    <comment>Пол женский</comment>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/СтепениРодства/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Заполняет справочник по классификатору.
Процедура НачальноеЗаполнениеСтепенейРодства() Экспорт	
	
	ТекстXML	= Справочники.СтепениРодства.ПолучитьМакет("ПервоначальноеЗаполнение").ПолучитьТекст();
	ТаблицаОКИН	= ОбщегоНазначенияСервер.ПрочитатьXMLВТаблицу(ТекстXML).Данные;
	
	Для Каждого СтрокаОКИН Из ТаблицаОКИН Цикл
		Если ЗначениеЗаполнено(СтрокаОКИН.КодФСС) Тогда
			ТекущийЭлементСсылка = НайтиПоРеквизиту("КодФСС", СтрокаОКИН.КодФСС);
		ИначеЕсли ЗначениеЗаполнено(СтрокаОКИН.КодОКИН) Тогда
			ТекущийЭлементСсылка = НайтиПоРеквизиту("КодОКИН", СтрокаОКИН.КодОКИН);
		КонецЕсли;
			
		Если ЗначениеЗаполнено(ТекущийЭлементСсылка) Тогда
			ТекущийЭлемент = ТекущийЭлементСсылка.ПолучитьОбъект();
		Иначе
			ТекущийЭлемент = СоздатьЭлемент();	
		КонецЕсли;                                                
		
		ЗаполнитьЗначенияСвойств(ТекущийЭлемент, СтрокаОКИН);
		ТекущийЭлемент.Записать();
	КонецЦикла;
	  
КонецПроцедуры

// Проставить код типа родственной связи в ФР НСИ ЕГИСЗ.
Процедура СопоставитьСКодамиЕГИСЗ() Экспорт 
	
	МакетТаблицы = Справочники.СтепениРодства.ПолучитьМакет("СопоставлениеСКодамиЕГИСЗ");
	ВысотаТаблицы = МакетТаблицы.ВысотаТаблицы;
	Для Сч = 2 По ВысотаТаблицы Цикл
		КодФССЯчейки  = МакетТаблицы.Область(Сч,1,Сч,1).Текст;
		КодОКИНЯчейки = МакетТаблицы.Область(Сч,2,Сч,2).Текст;
		КодЕГИСЗЯчейки = МакетТаблицы.Область(Сч,3,Сч,3).Текст; 
		
		Если ЗначениеЗаполнено(КодЕГИСЗЯчейки) Тогда 
			Если ЗначениеЗаполнено(КодФССЯчейки) Тогда
				ТекущийЭлементСсылка = НайтиПоРеквизиту("КодФСС", КодФССЯчейки);
			ИначеЕсли ЗначениеЗаполнено(КодОКИНЯчейки) Тогда
				ТекущийЭлементСсылка = НайтиПоРеквизиту("КодОКИН", КодОКИНЯчейки);
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекущийЭлементСсылка) Тогда
				ТекущийЭлемент = ТекущийЭлементСсылка.ПолучитьОбъект();	
				ТекущийЭлемент.КодЕГИСЗ = КодЕГИСЗЯчейки; 
				ТекущийЭлемент.Записать();			
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	
КонецПроцедуры

// Если для родственника есть соответствующее ответное родство, возвращает его.
//
// Параметры:
//  ТипСвязи - СправочникСсылка.СтепениРодства - Исходный тип родственной связи.
//	ПолРодственника - ПеречислениеСсылка.ПолФизическихЛиц - пол.
// 
// Возвращаемое значение:
// 	СправочникСсылка.СтепениРодства.
//
Функция ПолучитьОтветнуюРодственнуюСвязь(ТипСвязи, ПолРодственника) Экспорт
	
	РезультатПоиска = Справочники.СтепениРодства.ПустаяСсылка();
	
	МакетТаблицы = Справочники.СтепениРодства.ПолучитьМакет("ОбратноеРодство");
	ВысотаТаблицы = МакетТаблицы.ВысотаТаблицы;
	
	Если ЗначениеЗаполнено(ПолРодственника) Тогда
		
		ЭтоМужчина = ПолРодственника = Перечисления.ПолФизическихЛиц.Мужской;
	
		Для Сч = 2 По ВысотаТаблицы Цикл
			КодФССЯчейки  = МакетТаблицы.Область(Сч,1,Сч,1).Текст;
			КодОКИНЯчейки = МакетТаблицы.Область(Сч,2,Сч,2).Текст;
			Если (ЗначениеЗаполнено(ТипСвязи.КодФСС) И ТипСвязи.КодФСС = КодФССЯчейки) 
				Или (ЗначениеЗаполнено(ТипСвязи.КодОКИН) И ТипСвязи.КодОКИН = КодОКИНЯчейки)
			Тогда
				Если ЭтоМужчина Тогда
					КодФСССвязи  = МакетТаблицы.Область(Сч,3,Сч,3).Текст;
					КодОКИНСвязи = МакетТаблицы.Область(Сч,4,Сч,4).Текст;			
				Иначе
					КодФСССвязи  = МакетТаблицы.Область(Сч,5,Сч,5).Текст;
					КодОКИНСвязи = МакетТаблицы.Область(Сч,6,Сч,6).Текст;	
				КонецЕсли;
				
				Если ЗначениеЗаполнено(КодОКИНСвязи) Тогда
					РезультатПоиска = Справочники.СтепениРодства.НайтиПоРеквизиту("КодОКИН",КодОКИНСвязи);
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(РезультатПоиска)
					И ЗначениеЗаполнено(КодФСССвязи)
				Тогда
					РезультатПоиска = Справочники.СтепениРодства.НайтиПоРеквизиту("КодФСС",КодФСССвязи);
				КонецЕсли;
				
				Прервать;
				
			КонецЕсли; 	
		КонецЦикла;
	КонецЕсли;
	
	Возврат РезультатПоиска;
	
КонецФункции

// Процедура - Удалить обратную родственную связь.
//
// Параметры:
//  Клиент	 - СправочникСсылка.Клиенты	 - Клиент, у которого удаляем связь.
//  Клиент2	 - СправочникСсылка.Клиенты	 - Клиент, связь с которым удаляем.
//
Процедура УдалитьРодственнуюСвязь(Клиент, Клиент2) Экспорт
	
	Запись = РегистрыСведений.СвязиМеждуКлиентами.СоздатьМенеджерЗаписи();
	Запись.Клиент	= Клиент;
	Запись.Клиент2	= Клиент2;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.Удалить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
